ir_version: 6
producer_name: "pytorch"
producer_version: "1.5"
model_version: 0
graph {
  name: "torch-jit-export"
  node {
    input: "input.1"
    input: "stage1.rebnconvin.conv_s1.weight"
    input: "stage1.rebnconvin.conv_s1.bias"
    output: "799"
    name: "Conv_0"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "799"
    input: "stage1.rebnconvin.bn_s1.weight"
    input: "stage1.rebnconvin.bn_s1.bias"
    input: "stage1.rebnconvin.bn_s1.running_mean"
    input: "stage1.rebnconvin.bn_s1.running_var"
    output: "800"
    name: "BatchNormalization_1"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "800"
    output: "801"
    name: "Relu_2"
    op_type: "Relu"
  }
  node {
    input: "801"
    input: "stage1.rebnconv1.conv_s1.weight"
    input: "stage1.rebnconv1.conv_s1.bias"
    output: "802"
    name: "Conv_3"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "802"
    input: "stage1.rebnconv1.bn_s1.weight"
    input: "stage1.rebnconv1.bn_s1.bias"
    input: "stage1.rebnconv1.bn_s1.running_mean"
    input: "stage1.rebnconv1.bn_s1.running_var"
    output: "803"
    name: "BatchNormalization_4"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "803"
    output: "804"
    name: "Relu_5"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "805"
    name: "MaxPool_6"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "805"
    input: "stage1.rebnconv2.conv_s1.weight"
    input: "stage1.rebnconv2.conv_s1.bias"
    output: "806"
    name: "Conv_7"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "806"
    input: "stage1.rebnconv2.bn_s1.weight"
    input: "stage1.rebnconv2.bn_s1.bias"
    input: "stage1.rebnconv2.bn_s1.running_mean"
    input: "stage1.rebnconv2.bn_s1.running_var"
    output: "807"
    name: "BatchNormalization_8"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "807"
    output: "808"
    name: "Relu_9"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "809"
    name: "MaxPool_10"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "809"
    input: "stage1.rebnconv3.conv_s1.weight"
    input: "stage1.rebnconv3.conv_s1.bias"
    output: "810"
    name: "Conv_11"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "810"
    input: "stage1.rebnconv3.bn_s1.weight"
    input: "stage1.rebnconv3.bn_s1.bias"
    input: "stage1.rebnconv3.bn_s1.running_mean"
    input: "stage1.rebnconv3.bn_s1.running_var"
    output: "811"
    name: "BatchNormalization_12"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "811"
    output: "812"
    name: "Relu_13"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "813"
    name: "MaxPool_14"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "813"
    input: "stage1.rebnconv4.conv_s1.weight"
    input: "stage1.rebnconv4.conv_s1.bias"
    output: "814"
    name: "Conv_15"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "814"
    input: "stage1.rebnconv4.bn_s1.weight"
    input: "stage1.rebnconv4.bn_s1.bias"
    input: "stage1.rebnconv4.bn_s1.running_mean"
    input: "stage1.rebnconv4.bn_s1.running_var"
    output: "815"
    name: "BatchNormalization_16"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "815"
    output: "816"
    name: "Relu_17"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "817"
    name: "MaxPool_18"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "817"
    input: "stage1.rebnconv5.conv_s1.weight"
    input: "stage1.rebnconv5.conv_s1.bias"
    output: "818"
    name: "Conv_19"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "818"
    input: "stage1.rebnconv5.bn_s1.weight"
    input: "stage1.rebnconv5.bn_s1.bias"
    input: "stage1.rebnconv5.bn_s1.running_mean"
    input: "stage1.rebnconv5.bn_s1.running_var"
    output: "819"
    name: "BatchNormalization_20"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "819"
    output: "820"
    name: "Relu_21"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "821"
    name: "MaxPool_22"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "821"
    input: "stage1.rebnconv6.conv_s1.weight"
    input: "stage1.rebnconv6.conv_s1.bias"
    output: "822"
    name: "Conv_23"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "822"
    input: "stage1.rebnconv6.bn_s1.weight"
    input: "stage1.rebnconv6.bn_s1.bias"
    input: "stage1.rebnconv6.bn_s1.running_mean"
    input: "stage1.rebnconv6.bn_s1.running_var"
    output: "823"
    name: "BatchNormalization_24"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "823"
    output: "824"
    name: "Relu_25"
    op_type: "Relu"
  }
  node {
    input: "824"
    input: "stage1.rebnconv7.conv_s1.weight"
    input: "stage1.rebnconv7.conv_s1.bias"
    output: "825"
    name: "Conv_26"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "825"
    input: "stage1.rebnconv7.bn_s1.weight"
    input: "stage1.rebnconv7.bn_s1.bias"
    input: "stage1.rebnconv7.bn_s1.running_mean"
    input: "stage1.rebnconv7.bn_s1.running_var"
    output: "826"
    name: "BatchNormalization_27"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "826"
    output: "827"
    name: "Relu_28"
    op_type: "Relu"
  }
  node {
    input: "827"
    input: "824"
    output: "828"
    name: "Concat_29"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "828"
    input: "stage1.rebnconv6d.conv_s1.weight"
    input: "stage1.rebnconv6d.conv_s1.bias"
    output: "829"
    name: "Conv_30"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "829"
    input: "stage1.rebnconv6d.bn_s1.weight"
    input: "stage1.rebnconv6d.bn_s1.bias"
    input: "stage1.rebnconv6d.bn_s1.running_mean"
    input: "stage1.rebnconv6d.bn_s1.running_var"
    output: "830"
    name: "BatchNormalization_31"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "830"
    output: "831"
    name: "Relu_32"
    op_type: "Relu"
  }
  node {
    input: "820"
    output: "832"
    name: "Shape_33"
    op_type: "Shape"
  }
  node {
    output: "833"
    name: "Constant_34"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "832"
    input: "833"
    output: "834"
    name: "Gather_35"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "820"
    output: "835"
    name: "Shape_36"
    op_type: "Shape"
  }
  node {
    output: "836"
    name: "Constant_37"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "835"
    input: "836"
    output: "837"
    name: "Gather_38"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "834"
    output: "838"
    name: "Unsqueeze_39"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "837"
    output: "839"
    name: "Unsqueeze_40"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "838"
    input: "839"
    output: "840"
    name: "Concat_41"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "841"
    name: "Constant_42"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "840"
    output: "842"
    name: "Cast_43"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "831"
    output: "843"
    name: "Shape_44"
    op_type: "Shape"
  }
  node {
    output: "844"
    name: "Constant_45"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "845"
    name: "Constant_46"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "846"
    name: "Constant_47"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "843"
    input: "845"
    input: "846"
    input: "844"
    output: "847"
    name: "Slice_48"
    op_type: "Slice"
  }
  node {
    input: "847"
    output: "848"
    name: "Cast_49"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "842"
    input: "848"
    output: "849"
    name: "Div_50"
    op_type: "Div"
  }
  node {
    input: "841"
    input: "849"
    output: "850"
    name: "Concat_51"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "831"
    input: "850"
    output: "851"
    name: "Resize_52"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  node {
    input: "851"
    input: "820"
    output: "852"
    name: "Concat_53"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "852"
    input: "stage1.rebnconv5d.conv_s1.weight"
    input: "stage1.rebnconv5d.conv_s1.bias"
    output: "853"
    name: "Conv_54"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "853"
    input: "stage1.rebnconv5d.bn_s1.weight"
    input: "stage1.rebnconv5d.bn_s1.bias"
    input: "stage1.rebnconv5d.bn_s1.running_mean"
    input: "stage1.rebnconv5d.bn_s1.running_var"
    output: "854"
    name: "BatchNormalization_55"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "854"
    output: "855"
    name: "Relu_56"
    op_type: "Relu"
  }
  node {
    input: "816"
    output: "856"
    name: "Shape_57"
    op_type: "Shape"
  }
  node {
    output: "857"
    name: "Constant_58"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "856"
    input: "857"
    output: "858"
    name: "Gather_59"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "816"
    output: "859"
    name: "Shape_60"
    op_type: "Shape"
  }
  node {
    output: "860"
    name: "Constant_61"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "859"
    input: "860"
    output: "861"
    name: "Gather_62"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "858"
    output: "862"
    name: "Unsqueeze_63"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "861"
    output: "863"
    name: "Unsqueeze_64"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "862"
    input: "863"
    output: "864"
    name: "Concat_65"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "865"
    name: "Constant_66"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "864"
    output: "866"
    name: "Cast_67"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "855"
    output: "867"
    name: "Shape_68"
    op_type: "Shape"
  }
  node {
    output: "868"
    name: "Constant_69"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "869"
    name: "Constant_70"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "870"
    name: "Constant_71"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "867"
    input: "869"
    input: "870"
    input: "868"
    output: "871"
    name: "Slice_72"
    op_type: "Slice"
  }
  node {
    input: "871"
    output: "872"
    name: "Cast_73"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "866"
    input: "872"
    output: "873"
    name: "Div_74"
    op_type: "Div"
  }
  node {
    input: "865"
    input: "873"
    output: "874"
    name: "Concat_75"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "855"
    input: "874"
    output: "875"
    name: "Resize_76"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  node {
    input: "875"
    input: "816"
    output: "876"
    name: "Concat_77"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "876"
    input: "stage1.rebnconv4d.conv_s1.weight"
    input: "stage1.rebnconv4d.conv_s1.bias"
    output: "877"
    name: "Conv_78"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "877"
    input: "stage1.rebnconv4d.bn_s1.weight"
    input: "stage1.rebnconv4d.bn_s1.bias"
    input: "stage1.rebnconv4d.bn_s1.running_mean"
    input: "stage1.rebnconv4d.bn_s1.running_var"
    output: "878"
    name: "BatchNormalization_79"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "878"
    output: "879"
    name: "Relu_80"
    op_type: "Relu"
  }
  node {
    input: "812"
    output: "880"
    name: "Shape_81"
    op_type: "Shape"
  }
  node {
    output: "881"
    name: "Constant_82"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "880"
    input: "881"
    output: "882"
    name: "Gather_83"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "812"
    output: "883"
    name: "Shape_84"
    op_type: "Shape"
  }
  node {
    output: "884"
    name: "Constant_85"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "883"
    input: "884"
    output: "885"
    name: "Gather_86"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "882"
    output: "886"
    name: "Unsqueeze_87"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "885"
    output: "887"
    name: "Unsqueeze_88"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "886"
    input: "887"
    output: "888"
    name: "Concat_89"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "889"
    name: "Constant_90"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "888"
    output: "890"
    name: "Cast_91"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "879"
    output: "891"
    name: "Shape_92"
    op_type: "Shape"
  }
  node {
    output: "892"
    name: "Constant_93"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "893"
    name: "Constant_94"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "894"
    name: "Constant_95"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "891"
    input: "893"
    input: "894"
    input: "892"
    output: "895"
    name: "Slice_96"
    op_type: "Slice"
  }
  node {
    input: "895"
    output: "896"
    name: "Cast_97"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "890"
    input: "896"
    output: "897"
    name: "Div_98"
    op_type: "Div"
  }
  node {
    input: "889"
    input: "897"
    output: "898"
    name: "Concat_99"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "879"
    input: "898"
    output: "899"
    name: "Resize_100"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  node {
    input: "899"
    input: "812"
    output: "900"
    name: "Concat_101"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "900"
    input: "stage1.rebnconv3d.conv_s1.weight"
    input: "stage1.rebnconv3d.conv_s1.bias"
    output: "901"
    name: "Conv_102"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "901"
    input: "stage1.rebnconv3d.bn_s1.weight"
    input: "stage1.rebnconv3d.bn_s1.bias"
    input: "stage1.rebnconv3d.bn_s1.running_mean"
    input: "stage1.rebnconv3d.bn_s1.running_var"
    output: "902"
    name: "BatchNormalization_103"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "902"
    output: "903"
    name: "Relu_104"
    op_type: "Relu"
  }
  node {
    input: "808"
    output: "904"
    name: "Shape_105"
    op_type: "Shape"
  }
  node {
    output: "905"
    name: "Constant_106"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "904"
    input: "905"
    output: "906"
    name: "Gather_107"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "808"
    output: "907"
    name: "Shape_108"
    op_type: "Shape"
  }
  node {
    output: "908"
    name: "Constant_109"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "907"
    input: "908"
    output: "909"
    name: "Gather_110"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "906"
    output: "910"
    name: "Unsqueeze_111"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "909"
    output: "911"
    name: "Unsqueeze_112"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "910"
    input: "911"
    output: "912"
    name: "Concat_113"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "913"
    name: "Constant_114"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "912"
    output: "914"
    name: "Cast_115"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "903"
    output: "915"
    name: "Shape_116"
    op_type: "Shape"
  }
  node {
    output: "916"
    name: "Constant_117"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "917"
    name: "Constant_118"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "918"
    name: "Constant_119"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "915"
    input: "917"
    input: "918"
    input: "916"
    output: "919"
    name: "Slice_120"
    op_type: "Slice"
  }
  node {
    input: "919"
    output: "920"
    name: "Cast_121"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "914"
    input: "920"
    output: "921"
    name: "Div_122"
    op_type: "Div"
  }
  node {
    input: "913"
    input: "921"
    output: "922"
    name: "Concat_123"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "903"
    input: "922"
    output: "923"
    name: "Resize_124"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  node {
    input: "923"
    input: "808"
    output: "924"
    name: "Concat_125"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "924"
    input: "stage1.rebnconv2d.conv_s1.weight"
    input: "stage1.rebnconv2d.conv_s1.bias"
    output: "925"
    name: "Conv_126"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "925"
    input: "stage1.rebnconv2d.bn_s1.weight"
    input: "stage1.rebnconv2d.bn_s1.bias"
    input: "stage1.rebnconv2d.bn_s1.running_mean"
    input: "stage1.rebnconv2d.bn_s1.running_var"
    output: "926"
    name: "BatchNormalization_127"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "926"
    output: "927"
    name: "Relu_128"
    op_type: "Relu"
  }
  node {
    input: "804"
    output: "928"
    name: "Shape_129"
    op_type: "Shape"
  }
  node {
    output: "929"
    name: "Constant_130"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "928"
    input: "929"
    output: "930"
    name: "Gather_131"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "804"
    output: "931"
    name: "Shape_132"
    op_type: "Shape"
  }
  node {
    output: "932"
    name: "Constant_133"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "931"
    input: "932"
    output: "933"
    name: "Gather_134"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "930"
    output: "934"
    name: "Unsqueeze_135"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "933"
    output: "935"
    name: "Unsqueeze_136"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "934"
    input: "935"
    output: "936"
    name: "Concat_137"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    output: "937"
    name: "Constant_138"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 2
        data_type: 1
      }
      type: TENSOR
    }
  }
  node {
    input: "936"
    output: "938"
    name: "Cast_139"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "927"
    output: "939"
    name: "Shape_140"
    op_type: "Shape"
  }
  node {
    output: "940"
    name: "Constant_141"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "941"
    name: "Constant_142"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    output: "942"
    name: "Constant_143"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        dims: 1
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "939"
    input: "941"
    input: "942"
    input: "940"
    output: "943"
    name: "Slice_144"
    op_type: "Slice"
  }
  node {
    input: "943"
    output: "944"
    name: "Cast_145"
    op_type: "Cast"
    attribute {
      name: "to"
      i: 1
      type: INT
    }
  }
  node {
    input: "938"
    input: "944"
    output: "945"
    name: "Div_146"
    op_type: "Div"
  }
  node {
    input: "937"
    input: "945"
    output: "946"
    name: "Concat_147"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "927"
    input: "946"
    output: "947"
    name: "Resize_148"
    op_type: "Resize"
    attribute {
      name: "mode"
      s: "linear"
      type: STRING
    }
  }
  node {
    input: "947"
    input: "804"
    output: "948"
    name: "Concat_149"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "948"
    input: "stage1.rebnconv1d.conv_s1.weight"
    input: "stage1.rebnconv1d.conv_s1.bias"
    output: "949"
    name: "Conv_150"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "949"
    input: "stage1.rebnconv1d.bn_s1.weight"
    input: "stage1.rebnconv1d.bn_s1.bias"
    input: "stage1.rebnconv1d.bn_s1.running_mean"
    input: "stage1.rebnconv1d.bn_s1.running_var"
    output: "950"
    name: "BatchNormalization_151"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "950"
    output: "951"
    name: "Relu_152"
    op_type: "Relu"
  }
  node {
    input: "951"
    input: "801"
    output: "952"
    name: "Add_153"
    op_type: "Add"
  }
  node {
    input: "952"
    output: "953"
    name: "MaxPool_154"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "953"
    input: "stage2.rebnconvin.conv_s1.weight"
    input: "stage2.rebnconvin.conv_s1.bias"
    output: "954"
    name: "Conv_155"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "954"
    input: "stage2.rebnconvin.bn_s1.weight"
    input: "stage2.rebnconvin.bn_s1.bias"
    input: "stage2.rebnconvin.bn_s1.running_mean"
    input: "stage2.rebnconvin.bn_s1.running_var"
    output: "955"
    name: "BatchNormalization_156"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "955"
    output: "956"
    name: "Relu_157"
    op_type: "Relu"
  }
  node {
    input: "956"
    input: "stage2.rebnconv1.conv_s1.weight"
    input: "stage2.rebnconv1.conv_s1.bias"
    output: "957"
    name: "Conv_158"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "957"
    input: "stage2.rebnconv1.bn_s1.weight"
    input: "stage2.rebnconv1.bn_s1.bias"
    input: "stage2.rebnconv1.bn_s1.running_mean"
    input: "stage2.rebnconv1.bn_s1.running_var"
    output: "958"
    name: "BatchNormalization_159"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "958"
    output: "959"
    name: "Relu_160"
    op_type: "Relu"
  }
  node {
    input: "959"
    output: "960"
    name: "MaxPool_161"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "960"
    input: "stage2.rebnconv2.conv_s1.weight"
    input: "stage2.rebnconv2.conv_s1.bias"
    output: "961"
    name: "Conv_162"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "961"
    input: "stage2.rebnconv2.bn_s1.weight"
    input: "stage2.rebnconv2.bn_s1.bias"
    input: "stage2.rebnconv2.bn_s1.running_mean"
    input: "stage2.rebnconv2.bn_s1.running_var"
    output: "962"
    name: "BatchNormalization_163"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "962"
    output: "963"
    name: "Relu_164"
    op_type: "Relu"
  }
  node {
    input: "963"
    output: "964"
    name: "MaxPool_165"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "964"
    input: "stage2.rebnconv3.conv_s1.weight"
    input: "stage2.rebnconv3.conv_s1.bias"
    output: "965"
    name: "Conv_166"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "965"
    input: "stage2.rebnconv3.bn_s1.weight"
    input: "stage2.rebnconv3.bn_s1.bias"
    input: "stage2.rebnconv3.bn_s1.running_mean"
    input: "stage2.rebnconv3.bn_s1.running_var"
    output: "966"
    name: "BatchNormalization_167"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "966"
    output: "967"
    name: "Relu_168"
    op_type: "Relu"
  }
  node {
    input: "967"
    output: "968"
    name: "MaxPool_169"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "968"
    input: "stage2.rebnconv4.conv_s1.weight"
    input: "stage2.rebnconv4.conv_s1.bias"
    output: "969"
    name: "Conv_170"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "969"
    input: "stage2.rebnconv4.bn_s1.weight"
    input: "stage2.rebnconv4.bn_s1.bias"
    input: "stage2.rebnconv4.bn_s1.running_mean"
    input: "stage2.rebnconv4.bn_s1.running_var"
    output: "970"
    name: "BatchNormalization_171"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "970"
    output: "971"
    name: "Relu_172"
    op_type: "Relu"
  }
  node {
    input: "971"
    output: "972"
    name: "MaxPool_173"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "972"
    input: "stage2.rebnconv5.conv_s1.weight"
    input: "stage2.rebnconv5.conv_s1.bias"
    output: "973"
    name: "Conv_174"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "973"
    input: "stage2.rebnconv5.bn_s1.weight"
    input: "stage2.rebnconv5.bn_s1.bias"
    input: "stage2.rebnconv5.bn_s1.running_mean"
    input: "stage2.rebnconv5.bn_s1.running_var"
    output: "974"
    name: "BatchNormalization_175"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "974"
    output: "975"
    name: "Relu_176"
    op_type: "Relu"
  }
  node {
    input: "975"
    input: "stage2.rebnconv6.conv_s1.weight"
    input: "stage2.rebnconv6.conv_s1.bias"
    output: "976"
    name: "Conv_177"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "976"
    input: "stage2.rebnconv6.bn_s1.weight"
    input: "stage2.rebnconv6.bn_s1.bias"
    input: "stage2.rebnconv6.bn_s1.running_mean"
    input: "stage2.rebnconv6.bn_s1.running_var"
    output: "977"
    name: "BatchNormalization_178"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "977"
    output: "978"
    name: "Relu_179"
    op_type: "Relu"
  }
  node {
    input: "978"
    input: "975"
    output: "979"
    name: "Concat_180"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "979"
    input: "stage2.rebnconv5d.conv_s1.weight"
    input: "stage2.rebnconv5d.conv_s1.bias"
    output: "980"
    name: "Conv_181"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "980"
    input: "stage2.rebnconv5d.bn_s1.weight"
    input: "stage2.rebnconv5d.bn_s1.bias"
    input: "stage2.rebnconv5d.bn_s1.running_mean"
    input: "stage2.rebnconv5d.bn_s1.running_var"
    output: "981"
    name: "BatchNormalization_182"
    op_type: "BatchNormalization"
    attribute {
      name: "epsilon"
      f: 9.999999747378752e-06
      type: FLOAT
    }
    attribute {
      name: "momentum"
      f: 0.8999999761581421
      type: FLOAT
    }
  }
  node {
    input: "981"
    output: "982"
    name: "Relu_183"
    op_type: "Relu"
  }
  node {
    input: "971"
    output: "983"
    name: "Shape_184"
    op_type: "Shape"
  }
  node {
    output: "984"
    name: "Constant_185"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "983"
    input: "984"
    output: "985"
    name: "Gather_186"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "971"
    output: "986"
    name: "Shape_187"
    op_type: "Shape"
  }
  node {
    output: "987"
    name: "Constant_188"
    op_type: "Constant"
    attribute {
      name: "value"
      t {
        data_type: 7
      }
      type: TENSOR
    }
  }
  node {
    input: "986"
    input: "987"
    output: "988"
    name: "Gather_189"
    op_type: "Gather"
    attribute {
      name: "axis"
      i: 0
      type: INT
    }
  }
  node {
    input: "985"
    output: "989"
    name: "Unsqueeze_190"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "988"
    output: "990"
    name: "Unsqueeze_191"
    op_type: "Unsqueeze"
    attribute {
      name: "axes"
      ints: 0
      type: INTS
    }
  }
  node {
    input: "989"
    input: "990"
    output: "991"
    name: "Concat_192"
    op_type: "Concat"
